# ----------------------------------Exercise #1------------------------------
# Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.
# Пример:
# - 6 -> да
# - 7 -> да
# - 1 -> нет
# ----------------------------------SOLUTION-----------------------------------
# def holydays():
#     a = int(input("впишите день недели "))
#     if a == 6 or a == 7:
#         print(f"{a} -> да")
#     elif 0 < a < 6:
#         print(f"{a} -> нет")
#     else:
#         print(f"{a} -> введен не день недели")
#         holydays()


# holydays()

# ----------------------------------Exercise #2------------------------------
# Напишите программу для. проверки истинности утверждения ¬(X ⋁ Y ⋁ Z) = ¬X ⋀ ¬Y ⋀ ¬Z для всех значений предикат. ¬ - Отрицание ⋁ - логическое "Или" ⋀ - логическое "И"
# fExpression = input("Первая предитата = ")
# sExpression = input("Вторая предитата = ")
# trdExpression = input("Тертья предитата = ")
# ----------------------------------SOLUTION-----------------------------------
# def logicCheck(X, Y, Z):
#     firstHalf = X or Y or Z
#     secondHalf = not X and not Y and not Z
#     check = not firstHalf == secondHalf
#     print(check)


# logicCheck(fExpression, sExpression, trdExpression)


# ----------------------------------Exercise #3------------------------------
# Напишите программу, которая принимает на вход координаты точки (X и Y), причём X ≠ 0 и Y ≠ 0 и выдаёт номер четверти плоскости, в которой находится эта точка (или на какой оси она находится).
# Пример:
# - x=34; y=-30 -> 4
# - x=2; y=4-> 1
# - x=-34; y=-30 -> 3
# ----------------------------------SOLUTION-----------------------------------

x = int(input("Координату X, Пожалуйста : "))
y = int(input("Координату Y, Пожалуйста : "))


def quadrant(x, y):
    if x > 0 and y > 0:
        print("Вы в ПЕРВОМ квадранте")
    elif x < 0 and y > 0:
        print("Вы во ВТОРОМ квадранте")
    elif x < 0 and y < 0:
        print("Вы в ТРЕТЬЕМ квадранте")
    elif x > 0 and y < 0:
        print("Вы в ЧЕТВЕРТОМ квадранте")
    else:
        print(f"Да вы НЕ в квадрантах, {axis(x,y)}")


def axis(x, y):
    if y == 0:
        return "вы на оси Y"
    elif x == 0:
        return "вы на оси X"


quadrant(x, y)
# ----------------------------------Exercise #4------------------------------
# Напишите программу, которая по заданному номеру четверти, показывает диапазон возможных координат точек в этой четверти (x и y).

# ----------------------------------SOLUTION-----------------------------------

# quarter = input("Укажите четверть для отображения  ")

# quarterRangeX = {
#     '1': " 0 < X < Infinity",
#     '2': " -Infinity < X < 0",
#     '3': " -Infinity < X < 0",
#     '4': " 0 < X < Infinity"}
# quarterRangeY = {
#     '1': " 0 < Y < Infinity",
#     '2': "  0 < Y < Infinity",
#     '3': " -Infinity < Y < 0",
#     '4': " -Infinity < Y < 0"}

# print(quarterRangeX[quarter])
# print(quarterRangeY[quarter])


# ----------------------------------Exercise #5------------------------------
# Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 2D пространстве.
# Пример:
# - A (3,6); B (2,1) -> 5,09
# - A (7,-5); B (1,-1) -> 7,21
# ----------------------------------SOLUTION-----------------------------------

# frstPoint = list(
#     input("Введите координаты первой точки через пробел ").split())
# scndPoint = list(
#     input("Введите координаты первой точки через пробел ").split())
# print(frstPoint[1])
# print(scndPoint)


# def distance(fP, scdP):
#     if len(fP) != len(scdP):
#         print("Точки в разных измерениях")
#     else:
#         dist = float(0)
#         for i in range(len(fP)):
#             dist += (int(scdP[i])-int(fP[i]))**2
#         print(f"Прямое расстояние между точками {round(dist**(1/2),2)}")


# distance(frstPoint, scndPoint)
